const pulseDate = {
  health_report_id: "ctdej3ejq8hlgmdttj90",
  create_time: "2024-12-12 21:47:57",
  health_risk_index: {
    risk_name: "综合风险",
    index_value: 33,
    risk_id: "risk_0",
    degree: "轻风险",
  },
  report_summary:
    "您的身体有超负荷的现象，健康可是人生最大的宝藏！注意生活作息，让您朝着健康的方向更进一步。",
  heart_rate: 66,
  blood_oxygen: 99,
  risk: [
    {
      risk_name: "血压风险",
      index_value: 16,
      risk_id: "risk_1",
      degree: "无风险",
      describe: {
        describe:
          "血压是心脏收缩时对血管提供的压力，依照心脏以及全身血管的健康度而有所改变，是身体健康的一项重要的指标。当您的血压风险增高，代表您的脉象结果与大数据中高血压或低血压的病患脉象结果相似，这并不代表您已经有高血压或低血压的情况，而是身体的体质属于容易有高血压或低血压的倾向，发生高血压或低血压的机会比其他人来得高。若不积极注意调理体质，长期下来会出现高血压或低血压，进而导致心血管、中风的机会也会增加，为了预防疾病，建议从现在开始注意饮食与生活习惯的调整。",
        refer:
          "肺虚的人呼吸系统功能较差、身体氧气与二氧化碳交换能力不足，导致慢性的全身性缺氧，以及二氧化碳堆积。身体为了弥补缺氧的状态会代偿性地提高血压、确保末梢的细胞也有足够的氧气供给，同时慢性缺氧会造成身体细胞进入无氧代谢，增加体内乳酸的堆积，为了代谢体内过多的乳酸，会增加肝脏的负荷，导致肝经也会出现升高的状态。",
        reason:
          "先天性肺功能较差、姿势不良(驼背)、吸烟或长期处于空气质量不佳的环境等因素是主要导致肺经血液循不足的主因，增加血压异常的风险。",
      },
    },
    {
      risk_name: "血脂风险",
      index_value: 17,
      risk_id: "risk_2",
      degree: "无风险",
      describe: {
        describe:
          "血脂是血液中的脂肪，包括胆固醇、甘油三脂等脂肪在血液中的浓度。高血脂是血液中各种脂肪浓度比健康人的数值来得高，高血脂会增加心血管疾病、血管阻塞、\n身体慢性发炎，甚至是癌症的风险。当您的血脂风险偏高，代表您量测出来的脉相与大数据中高血脂的病患的脉象相似，属于容易出现高血脂的体质，为了避免真正出现高血脂或者是已经出现高血脂想要调降血脂，一定要从生活作息、饮食习惯以及运动等方面进行综合调理。",
        refer:
          "经由AI大数据分析，高血脂的人在脉象上常见肺虚。按照中医理论，肺虚(肺气不足)导致体内痰(湿)，痰在喉咙为痰，在血液中可能即是脂肪。",
        reason:
          "姿势不良(驼背)、吸烟或长期处于空气质量不佳的环境等因素是主要导致肺经血液循不足的主因，增加血脂过高的风险。高血脂本身与(基因)脂肪代谢、饮食习惯以及肥胖有关。",
      },
    },
    {
      risk_name: "血糖风险",
      index_value: 3,
      risk_id: "risk_3",
      degree: "无风险",
      describe: {
        describe:
          "血糖是血液当中葡萄糖的浓度，太高或者是太低都会导致严重的问题。太高就是所谓的糖尿病，严重时会并发心血管疾病、肾病变、视网膜病变等疾病，太低则会造成晕眩甚至是休克，所以维持正常的血糖浓度对于身体健康是至关重要的。血糖风险增高时，代表您当下的脉象结果与大数据中第二型糖尿病病患的脉相相似，也就是说您的体质与有糖尿病的人体质接近，容易有血糖过高的机会。如果您的家人中有糖尿病的病史，或者是您本身已经有空腹血糖偏高、经常性低血糖的情况，建议您一定要更加注意自己的脉相，根据健康报告的建议做出生活习惯或膳食结构的改变。",
        refer:
          "脾经主要提供小肠、大肠以及胰脏的血液循环，当脾经能量不足，则胰脏的供血不够，无法正常地对血糖的变动做出正确的反应，制造出足够的胰岛素或者是升糖素平衡血糖的浓度，因而增加由血糖控制不佳的机会。",
        reason:
          "过度摄取的碳水化合物、蛋白质摄取不足，以及运动不够、肌肉衰弱等都会导致脾经的能量降低。脾经能量太低的情况，长期除了有血糖控制的问题之外，还容易有免疫功能低下、消化功能较差等问题。",
      },
    },
    {
      risk_name: "心血管风险",
      index_value: 3,
      risk_id: "risk_4",
      degree: "无风险",
      describe: {
        describe:
          "冠心病是心脏病中最常见的一种，因供应心脏血流的冠状动脉，脂肪逐渐堆积而导致血管变窄或阻塞不通，发生动脉粥样硬化。当血管阻塞的情形严重，通过的血流量降低，便会引发心肌缺氧而坏死。",
        refer:
          "在初期可能只是存在肺虚的情形、呼吸系统功能较差、氧气交换的不足，但长期下来会有全身性能量缺乏的情形，可能与心脏收缩匮乏有关，也可能是因为高血压、高血脂等因素导致冠状动脉硬化，导致心肌梗塞的风险增加。",
        reason:
          "长期过度疲劳、从事超出负荷的运动，或有高血压、高血脂等问题，也容易导致心冠风险的增加。",
      },
    },
    {
      risk_name: "脑血管风险",
      index_value: 21,
      risk_id: "risk_5",
      degree: "轻风险",
      describe: {
        describe:
          "脑缺血是因为血管阻塞，脑出血则是因为脑血管破裂而造成脑组织缺氧坏死，较多数的脑中风是因为脑血管阻塞所造成。",
        refer:
          "初期会有肺虚的情形、呼吸系统功能较差、氧气交换不足，长期下来会有全身性能量缺乏的情形，加上胆经血液循环不良、流往头上的血液不足，影响脑血管的健康。",
        reason:
          "长期过度疲劳、从事超出负荷的运动，或有高血压、高血脂等问题，也容易增加脑血管问题的风险。",
      },
    },
    {
      risk_name: "肝负担风险",
      index_value: 21,
      risk_id: "risk_6",
      degree: "轻风险",
      describe: {
        describe:
          "肝脏是体内最重要的器官之一，主要的功能包括解毒、消化食物及储存能量供人体使用，肝脏还有大约500个其他功能，协助维护人体健康。当肝脏无法正常运作时，全身器官都会收到影响，更会增加心血管疾病的风险。",
        refer:
          "当肝经的血液循环增加，代表肝脏的运作负荷增加，肝脏长期超负荷的工作，最终会导致各种营养素代谢的失衡。",
        reason:
          "熬夜、睡眠质量不佳，或者有饮酒、喝咖啡等习惯，都可能增加肝脏的负担！",
      },
    },
    {
      risk_name: "肾负担风险",
      index_value: 28,
      risk_id: "risk_7",
      degree: "轻风险",
      describe: {
        describe:
          "肾脏将多余的水分过滤后形成尿液排出，调节人体的水分，它也是一个默默工作的器官；因为疾病或不好的饮食习惯造成肾功能下降时，甚至已经罹患肾脏病，自己感觉不到，通常都是到就医检查了才发现。",
        refer: "当肾经的血液循环较差，常与肾脏功能不佳或先天体质较差相关。",
        reason:
          "平时运动较少、喝水较少、代谢较差等，或者饮食习惯偏向重口味(含钠高、含磷高等)，长期下来会增加肾脏的负担。",
      },
    },
    {
      risk_name: "消化力",
      index_value: 59,
      risk_id: "risk_8",
      degree: "中风险",
      describe: {
        describe:
          "“消化力”是人体的消化器官将食物变成可被机体吸收营养的过程，消化系统十分复杂且范围极广，从口腔到直肠都属于其范围。",
        refer: "当脾经低且胃经高的时候较容易有十二指肠溃疡的情形。",
        reason:
          "生活作息不规律、饮食不正常、压力过大或情绪方面的问题等，都可能影响消化系统功能。",
      },
    },
    {
      risk_name: "胃食道逆流风险",
      index_value: 26,
      risk_id: "risk_9",
      degree: "轻风险",
      describe: {
        describe:
          "“胃失调”指的是胃酸分泌过高导致胃食道逆流或十二指肠溃疡而有肠胃不适、胃口不佳的情形，如胃酸、食物、胆汁等倒流进入食道、咽喉、口腔，或呼吸道等部位所引起的不适症状。",
        refer:
          "当脾经和胃经同时血液循环较高的时候较容易有胃食道逆流的情形；脾经低、胃经高则容易有十二指肠溃疡的情形。",
        reason:
          "胃酸分泌过多、经常性的饥饿或饮食习惯不佳(三餐不定时、暴饮暴食等)等都可能造成胃食道反流。",
      },
    },
    {
      risk_name: "免疫力",
      index_value: 38,
      risk_id: "risk_10",
      degree: "轻风险",
      describe: {
        describe:
          "免疫系统就像是身体的保护伞和防护军，身体需要免疫力来对抗细菌病毒的攻击。",
        refer:
          "脾经血液循环较低、上肠系膜的血液循环较差、血糖控制不佳等，都容易有免疫系统功能不佳的情形。",
        reason:
          "经常性的蛋白质摄取不足、身体的代谢循环不佳、胰岛素调节失衡等，容易造成免疫系统功能低下。",
      },
    },
    {
      risk_name: "缺钙风险",
      index_value: 27,
      risk_id: "risk_11",
      degree: "轻风险",
      describe: {
        describe:
          "钙质是维持生命非常重要的矿物质，主要储存与骨骼与牙齿当中。当身体所需钙质不足时，会由骨骼提供，长久下来骨骼中钙质消耗过度，造成骨质疏松，容易发生骨折的机会。缺钙风险高的脉相出现时，代表身体因为酸碱平衡失调(过度的酸性化)，对于钙的需求增加。这时若没有在饮食中充分地补充，身体对钙质的需求量又增加，就有较高的机会导致骨骼中钙质消耗过度，骨质密度下降而造成骨折风险。建议补充钙质，以及调整身体体质改善钙质过度耗损的状态。",
        refer:
          "肺虚的人呼吸系统功能较差、身体氧气与二氧化碳交换能力不足，导致慢性的全身性缺氧，以及二氧化碳堆积。二氧化碳在体内呈现酸性，为了维持身体正常的酸碱状态，身体有许多平衡的机制，其中一个即为利用血液中的钙质与二氧化碳的水溶性成分结合，形成碳酸氢钙减少二氧化碳的酸性特质。当肺经虚弱，气体交换能力不足的时候，要特别注意钙质的补充，减少骨质疏松发生的机会。",
        reason:
          "先天性肺功能较差、姿势不良(驼背)、吸烟或长期处于空气质量不佳的环境等因素是主要导致肺经血液循不足的主因。长期缺乏钙质、维生素D的营养素的摄取，以及缺乏运动刺激，还有女性更年期后女性荷尔蒙减少等原因也会导致骨骼中的钙质会流失的更快。",
      },
    },
    {
      risk_name: "压力",
      index_value: 26,
      risk_id: "risk_12",
      degree: "轻风险",
      describe: {
        describe:
          "压力是面对情绪上或者身体上的有形或无形威胁时，无法正常回应的感受状态。过度的压力则会使其困扰、沮丧和气馁，导致肾上腺素增多，失去自控能力，影响身体健康。",
        refer:
          "当交感与副交感神经出现失衡状况，交感神经过度活化、头部的血液循环增加，使人感觉紧张、感觉压力。",
        reason:
          "睡眠质量不佳、运动不足、情绪不稳定(血清素不足或血清素生成受阻)等因素都可能减少身体面对压力的能力。",
      },
    },
    {
      risk_name: "疲劳",
      index_value: 28,
      risk_id: "risk_13",
      degree: "轻风险",
      describe: {
        describe:
          "疲劳是一种主观不适感觉，但客观上会在同等条件下，失去其完成原来所从事的正常活动或工作能力。",
        refer:
          "当冠状动脉血液增加，它代表全身需要的总能量增加，心脏需要更用力地收缩才能供给全身需要，也是身体超出负荷的象征。我们评估的是您当下身体的状态，不是主观的感受。",
        reason:
          "熬夜、睡眠质量不佳、情绪不稳定(血清素不足或血清素生成受阻)等因素都可能增加身体的疲倦感。",
      },
    },
    {
      risk_name: "睡眠质量",
      index_value: 20,
      risk_id: "risk_14",
      degree: "无风险",
      describe: {
        describe:
          "睡眠质量与身体健康息息相关。不良的睡眠质量，会延缓身体修复的时间和状态降低生活质量。",
        refer:
          "肺虚的人呼吸系统功能较差、胆经高的人头脑思虑较多，较容易影响睡眠质量。睡眠质量高风险的人指的是无法入睡，或者是入睡了，但起床后仍然感觉很疲劳；而有的人可能由于时间不够导致的睡眠不足。",
        reason:
          "呼吸系统功能较差，较容易因为氧气交换不足、影响睡眠质量。若在睡前流往头上的血液循环过度旺盛，较容易有睡前思虑过多、难以入睡的情形。",
      },
    },
    {
      risk_name: "内分泌风险",
      index_value: 3,
      risk_id: "risk_15",
      degree: "无风险",
      describe: {
        describe:
          "身体的内分泌系统举足轻重，调控着各种生理功能，维持身体每日正常的运作以及稳定的状态。身体血液循环的分布与调整也有赖于内分泌的影响。”内分泌风险”增高时的脉相，与男性/女性荷尔蒙失调时的脉相相似，身体失去了正常的血液分布的规则。建议您持续观察是否长期出现内分泌高风险的状况，如果持续出现高风险，最好做进一步的检查，确定身体的状态。",
        refer:
          "身体血液分布受到内分泌的调控，当内分泌失调时，身体常见的相互作用消失，引起经络能量分配的不正常现象。”内分泌风险”是以失去了正常的血液分布的规则为标准，与正常差异越大，则有内分泌失调的机会也就越大。",
        reason:
          "(女性)更年期期间由于荷尔蒙调整，常见内分泌风险的机会增加，其它像是过度减肥导致内分泌失调、女性妇科疾病、男性生殖器相关疾病，以及有年纪的长辈因为代谢减缓，也容易观察到内分泌失调的风险增加。",
      },
    },
    {
      risk_name: "过敏风险",
      index_value: 85,
      risk_id: "risk_16",
      degree: "高风险",
      describe: {
        describe:
          "对于过敏原如食物和花粉过度反应的现象，常见的过敏包含过敏性鼻炎、食物过敏、荨麻疹、异位性皮肤炎、哮喘于全身型过敏性反应等，症状可能由红眼、引起瘙痒的皮疹、流鼻水、呼吸困难与肿胀等。",
        refer:
          "可能有以下2种情况：1.脾经较高、免疫细胞过度活化的情形，身体处于不正常的发炎反应状态，因此会有过敏的风险。                   \n                                      2.脾经较低，免疫系统功能不全，容易因为环境、尘螨、气候等因素造成过敏",
        reason: "免疫系统功能过盛或免疫系统功能不足都会出现这种情况；",
      },
    },
    {
      risk_name: "感染风险",
      index_value: 3,
      risk_id: "risk_17",
      degree: "无风险",
      describe: {
        describe:
          "医学上的感染，是指细菌、病毒、真菌、寄生虫等病原体侵入人体所引起的局部组织和全身性炎症反应。",
        refer:
          "肾经、肺经、膀胱经高，脾经、胆经低的时候可能是身体发生慢性炎症或者感染，女性生理期、感冒或身体有发炎时也可能有这样的脉相。",
        reason:
          "精神压力过大、休息不足造成身体负荷过大等，都可能导致免疫功能低下，较容易遭病毒或细菌入侵、引起感染或发炎。",
      },
    },
    {
      risk_name: "胃酸过多风险",
      index_value: 12,
      risk_id: "risk_18",
      degree: "无风险",
      describe: {
        describe:
          "咽炎是指人类喉咙深部，咽喉的后部出现的炎症。通常会导致咽喉痛、发热，其他病症可能包括流鼻水还可能有流鼻涕、咳嗽、头痛、声音沙哑等症状，通常会持续3-5天，也可能会引发中耳炎和鼻窦炎。",
        refer:
          "胃酸分泌较多、加上体内有发炎状况的时候，较容易有胃食道逆流、咽喉发炎的情形。",
        reason: "胃酸分泌过多、胃食道逆流，或上呼吸道免疫系统功能不佳。",
      },
    },
  ],
  physique: "31过敏体质型",
  health_age: 43,
  wave_data: [],
  user_profile: {
    user_profile_id: "ctb6rrujq8hl7gnc2sk0",
    age: 54,
    hand: 3,
    gender: 2,
    height: 178,
    weight: 72,
  },
  physical_dialectics_list: [
    {
      physical_dialectics_cate_key: "JT007",
      physical_dialectics_cate_content: "阳虚质",
      describe: {
        signs:
          "【体征】阳气不足，以畏寒怕冷、手足不温等虚寒表现为主要特征。\n【形体特征】肌肉松软不实。\n【常见表现】平素畏冷，手足不温，喜热饮食，精神不振，舌淡胖嫩，脉沉迟。             \n【心理特征】性格多沉静、内向。\n【发病倾向】易患痰饮、肿胀、泄泻等病；感邪易从寒化。\n【适应能力】耐夏不耐冬；易感风、寒、湿邪。                   ",
        conditioning:
          "【环境起居】冬避寒就温，春夏培补阳气，多日光浴。避免风、寒、雾、雪，注重足下、背部及丹田部位的保暖。\n【体育锻炼】动则生阳，体育锻炼天天1至2次。宜舒缓柔和，如散步、慢跑、太极拳、五禽戏、八段锦等。\n【精神调适】这类人常情绪不佳，善恐、善悲。应保持沉静内敛，消除不良情绪。\n【饮食调理】 宜食温阳食品如羊肉、狗肉、鹿肉、鸡肉，少吃西瓜等生冷食物。\n【药物调养】请咨询专业的医师或者药师。",
      },
    },
  ],
  meridians: [
    {
      name: "心包经",
      date: -8,
      describe: {
        describe:
          "中医讲心包经，简称心包，亦称“腹中”，是心脏外部的一层薄膜，和心脏之间有部份体液，具有保护心脏的作用。\n心包在中医里是一个独立的经络，许多病症都和这个经络有关。如果要防止外邪逆传心包，而出现昏迷、胡言乱语等病入膏育症状，就请合理应用我们的心包经吧，它为心包所属，是一条救命的经络。",
        walk: "手厥阴心包经起始于胸中，出来则属于心包络，然后下行穿过膈肌，经历胸部至腹部而络于上、中、下三焦。\n 它的支脉是沿着胸腔而出于胁肋部，从腋下三寸处，上行达腋窝之下，沿着上臂内侧，行于手太阴经与手少阴经之间，进入肘关节中，下行沿前臂内侧行于桡侧腕屈肌腱与掌长肌腱(两筋)之间，进入手掌中，沿中指到达其末端。另一分支是从手掌中分出，沿第四指(小指次指间)到达其末端，接于手少阳三焦经。",
        summary:
          "主要病候：A 脏腑病：心病、胸闷、心悸、心烦、癫狂。B 经脉病：腋肿、肘臂挛急、掌心发热。\n主治概要：本经腧穴主治心、胸、胃、神志病以及经脉循行所过部位的其他病证。\n心包经发病，易引发的疾病和症状：1.与心包经联系的肌体组织和器官有：心包、三焦、胸、膈、上肢内侧中部。2.心包经发病出现的病症：腑中肿、臂拘急或痉挛、掌心发热。3.身体组织器官出现的病症：心脏疾病，心悸，胸中烦闷，心烦，神经疾病，嬉笑无常等。",
        reason: " 肥腻甜食、情志因素、生活习惯、大便不通、脾胃虚弱、肾虚、肺虚",
        performance:
          "偏低：大多表现为润滑液分泌不足、心跳异常、气喘、失眠多梦、心悸亢奋、语言障碍、手掌发热等、畏寒肢冷、失眠健忘、神经衰弱、心律不齐；严重者症见胸痹，冠脉堵塞、心绞痛等病。\n正常：此经络脉相平和，在运行气血，感应传导方面表现良好，请继续保持。\n偏高：心包发炎、胸闷、心痛、口舌糜烂肿痛、口唇及指甲青紫，上脘异常、喜欢睡、心血管病变、易头昏、头痛等。",
      },
    },
    {
      name: "肝经",
      date: 14,
      describe: {
        describe:
          "肝经是我们体内身怀绝技的治病高手。我们可以通过调节肝经保持全身气血畅达，避免因气机阻滞而出现胸肋、小腹的胀痛不适；可以保证脾胃的正常，减少因脾胃升降失调而出现的呃逆、呕吐；可以保持情绪的正常，摆脱因肝气不舒而出现的郁郁寡欢、暴怒、发火；还可以使男子排精畅通、女子月经规律，从而保障生殖功能的健全。",
        walk: "足厥阴肝经起于足大趾爪甲后丛毛处（大敦穴 ），沿足背内侧向上，经过内踝前1寸处（中封穴 ），上行小腿内侧（经过足太阴脾经 的三阴交 ），至内踝上8寸处交出于足太阴脾经的后面，至膝内侧（曲泉穴 ）沿大腿内侧中线，进入阴毛中，环绕过生殖器，至小腹，夹胃两旁，属于肝脏，联络胆腑，向上通过横膈，分布于胁肋部，沿喉咙之后，向上进入鼻咽部，连接目系（眼球连系于脑的部位），向上经前额到达巅顶与督脉交会。\n        目系分支：从目系走向面颊的深层，下行环绕口唇之内。\n        肝部分支：从肝分出，穿过横膈，向上流注于肺，与手太阴肺经相接",
        summary:
          "主要病候：腰痛得不好前俯后仰，男人可出现小肠疝气，女人可出现小腹肿胀，严重的则咽喉干，面部象有灰尘，没有血色。本经腧穴主治“肝”方面所发生的病症：胸闷，恶心呕吐，泄泻，小肠疝气，遗尿，癃闭。\n主治概要：本经腧穴主治肝胆病症、泌尿生殖系统、神经系统、眼科疾病和本经经脉所过部位的疾病。如：胸胁痛、少腹痛、疝气、遗尿、小便不利、遗精、月经不调、头痛目眩，下肢痹痛等症。\n主要表现：肝经不通会导致人体口感口苦，情志抑郁，胸胁胀痛；眩晕，血压不稳，易怒冲动；皮肤萎黄，易倦乏力，前列腺肥大；月经不调，复方疾病，小便黄等症状",
        reason:
          "情志因素：长期生活在比较压抑的环境下，或者长期精神抑郁、大怒等，都会伤肝。\n不良的生活习惯：两个重要因素就是熬夜和喝酒，运动量过大，用眼过度。\n心血虚弱：心脑需要大量的气血心脑使用过度，心血不足肝就虚弱。",
        performance:
          "偏低：易疲劳、性功能减退、头晕眼花或夜盲、两目干涩、面部烘热颧红、口干咽燥、五心烦热、胁肋隐隐作痛、手足颤动、面白无华、指甲无光泽、皮肤枯黄、肢体麻木、关节曲伸不利、妇女月经量少、色淡、甚则闭经。\n正常：此经络脉相平和，在运行气血，感应传导方面表现良好，请继续保持。   \n偏高：肝火旺、头晕腰痛、月经失调、失眠、肋间神经痛、目赤、易怒、头痛、耳鸣、眼干、视物模糊、口苦、吐血、咯血、脉弦数等。\n",
      },
    },
    {
      name: "肾经",
      date: -22,
      describe: {
        describe:
          "中医认为肾脏是人体最重要的脏器之一，有“先天之本”之称。\n肾的主要生理功能是藏精，这是推动人体活动的基本物质。肾经就是肾脏所主之经，它的气血运行畅通与否直接关系肾藏精的功能，间接影响脏腑的阴阳，因此是决定人生老病死的关键。\n如果我们想要提高生活质量、健康长寿，就必须经常按摩肾经，使经脉气血畅通。",
        walk: "足少阴肾经自足小趾的下边起始，斜行到足掌心中（涌泉），出行到然骨（舟骨粗隆）的下面，沿着内踝后方，分布在足跟中，由此向上在三阴交处与足太阴脾经、足厥阴肝经相会，然后行至腓肠肌内，浅出腘窝内侧（阴谷），沿大腿内侧后边向上，穿过脊柱，属于肾脏，联络膀胱。它直行的主干，从肾脏出来，向上穿过肝脏和膈肌，进入肺部，沿着气管喉咙，到舌根两侧。它的支脉。从肺脏出来，联络心，流注到胸中，脉气由此与手厥阴心包经相接。",
        summary:
          "主要病候：饥不欲食，面色发黑，喘息气逆，咳唾有血，目花，心悸，惊恐；口舌干燥，咽喉肿痛，心烦心痛，黄疸肠澼，脊柱、大腿内后廉痛，下肢肌肉萎缩，足底灼热疼痛等。\n主治概要：主治妇科、前阴、肾、肺、咽喉病证。如月经不调、阴挺、遗精、小便不利、水肿、便秘、泄泻，以及经脉循行部位的病变。\n主要表现：面黑如柴，头晕目眩；气短暴喘，咳嗽咯血；肚子饿却不想吃东西，心胸痛、腰、脊、下肢无力或肌肉萎缩麻木，脚底热、痛；心烦、易惊、易恐、口热、舌干、咽肿。",
        reason:
          "1.先天不足：因为先天之精不足，所以易导致肾虚；\n2.多因房事过度，或少年频繁手淫；\n3.思虑忧郁，损伤心脾，则病及阳明冲肾；\n4.恐惧伤肾，恐则伤肾；\n5.肝主筋，阴器为宗筋之汇，若情志不遂，忧思郁怒，肝失疏泄条达，则肾精所聚无能；\n6.湿热下注，肾宗筋弛纵；\n7.饮食不当，没规律，营养单一。经常食用油腻食物或辛辣食物、吸烟饮酒过度等。",
        performance:
          "偏低：耳鸣、健忘、尿频、性欲减退、便秘、元气不足、易疲劳、骨质疏松，畏寒、手脚冰冷、脚气、记忆力下降、注意力不集中、关节疼痛、腰膝酸软、不耐疲劳、脱发白发、眼袋、黑眼圈、肤色晦暗无光泽、肤质粗糙、干燥、出现皱纹、色斑。\n正常： 此经络脉相平和，在运行气血，感应传导方面表现良好，请继续保持。 \n偏高：感冒、生理期、耳鸣、月经不调、口干舌燥、血压异常、小便量少、色深、浑浊，性欲减退、神经衰弱、足发热发汗、生殖器病变等。",
      },
    },
    {
      name: "脾经",
      date: 47,
      describe: {
        describe:
          "中医认为，脾为后天之本，气血生化之源。脾的一个重要的功能就是主运化，运化功能旺盛，则机体的消化吸收功能才能健全，才能为化生精、气、血、津液提供足够原料，才能使脏腑、经络、四肢百骸，以及筋肉、皮、毛等组织得到充分的营养。\n脾经一发生异常，身体各种症状就会呈现出来。如心窝或胃附近会有重压感，出现疼痛、恶心、打嗝等现象。容易下痢或便秘，身体消瘦下去。尿量少，有时甚至完全无法排尿。脚部容易冰冷、浮肿、身体有倦念感。因为经常失眠，故身体感觉不适，不活跃。\n若出现以上所述的症状时，只要刺激经上的穴道，就能改善不适的症状。",
        walk: "起于足大趾末端（隐白），沿着大趾内侧赤白肉际，经第一跖趾关节向上行至内踝前，上行腿肚，交出足厥阴经的前面，经膝股部内侧前缘，进入腹部，属脾络胃，过膈上行，挟咽旁系舌根，散舌下。胃部支脉：过膈流注于心中，与心经相接。",
        summary:
          "主要病候：A 脏腑病：胃脘痛、食则呕、嗳气、腹胀便溏、黄疸、身重无力、舌根强痛。B 经脉病：下肢内侧肿胀、顾冷。\n主治概要：本经腧穴主治脾胃病、妇科、前阴病及经脉循行部位的其他病症。\n主要表现：该经发生病变主要表现为舌根强痛，腹胀，嗳气，胃痛，呕吐，心烦，泄泻，黄疸，身体沉重，动作不利，不能卧，膝股内侧肿、厥冷，足大趾不用等。",
        reason:
          "1.饮食原因：现代生活条件好了，吃生冷食物太多，肉食太多了，脾累坏了，生痰湿，痰 湿困脾引起脾虚。  \n2.思虑过多： 脾在志为思，然而久思伤脾。   \n3.肝的原因： 五行中，肝属木，脾胃属土。木克土，也就是肝气犯胃，肝郁气滞可以影响脾胃。  \n4.肾阳虚：如果肾阳虚损，将无法温煦脾土，可使脾运化水谷和津液的功能失常",
        performance:
          "偏低： 胃弱、膝异常、易失眠、疲劳、食欲不振、大便异常、腹胀等，消化不良，神疲肢冷、下肢水肿，月经失调，痰湿过重造成的肥胖。\n四肢发凉不温，大便不成形稀汤样，腹痛喜欢揉按。小便短少，舌苔发白。四肢乏力，食欲不振，饭后饱胀，舌头肥大有齿印。内分泌失调或分泌不足、中国人绝大多数脾虚，和我们的饮食有很大的关系，平均 -20%；长期脾 -40% 以上和糖尿病有密切关系，可以提醒糖尿病风险。\n正常：此经络脉相平和，在运行气血，感应传导方面表现良好，请继续保持。\n偏高： 脾胃不和消化吸收不好、易腹胀气打嗝、头疼、疲倦乏力、膝关节异常、排便异常等。脾气充足，中国人较少见。强烈过敏反应也会提示偏高。      ",
      },
    },
    {
      name: "肺经",
      date: 0,
      describe: {
        describe:
          "肺经乃以肺为中心，连接胸、手、手掌、拇指的经脉。肺部的功能主要是将空气吸入体内，并将其连送分配至五脏（内脏），以维持生存。若此机能发生异常时，会有上火、口干渴、胸痛、咳嗽、心悸、喘息等症状出现。此外，尚会产生脖根部痛、肘至手脱痛及麻痹等。随着身体机能降低，皮肤呈现干燥、没有光泽的现象、 脸色苍白、声音微弱、元气丧失，并连带地失去耐性。精神上也常会心情暗淡。\n当身体呈现以上所述的症状时，请刺激肺经上的穴位，使气血流通顺畅，身体便能迅速恢复健康。",
        walk: "起自中焦，向下联络大肠，回过来沿着胃的上口贯穿膈肌，入属肺脏，从肺系（气管、喉咙）横行出胸壁外上方（中府），走向腋下，沿上臂前外侧，行于手少阴心经和手厥阴心包经的外面，至肘中（尺泽）后再沿前臂桡侧下行至寸口（桡动脉搏动处），又沿大鱼际外缘出拇指桡侧端（少商）。\n其支脉从腕后桡骨茎突上方（列缺）分出，经手背虎口部至食指桡侧端（商阳）。脉气由此与手阳明大肠经相接。 ",
        summary:
          "主要病候： A 脏腑病：咳嗽、气喘、胸部胀满、咽喉肿痛，B 经脉病：缺盆部和手臂内侧前缘痛、肩背、寒冷、疼痛。\n主治概要：本经腧穴主治喉、胸、肺部病证，以及经脉循行部位的其他病证\n主要表现：肺经异常时，会出现胸闷、咳嗽、气喘、气短、心烦不安等症状。也会出现鼻塞，感冒，流涕、 伤风怕冷等症状 。肺经异常时，容易导致皮肤的改变，如一一些过敏性皮肤病、 色斑、无光泽等。",
        reason:
          "1.天气的变化：外界天气的变化，风，寒，暑，湿，燥，火等均可伤肺，大家都知道感冒伤风，受寒人就会出现咳嗽的症状。\n2.情志原因：人在情绪上的变化也会伤肺，如长期忧愁，悲伤，都会影响或伤害肺。\n3.天气污染：环境因素，如空气的污染会导致我们呼吸进去的空气污浊不堪而伤害肺。",
        performance:
          "偏低：免疫力下降，天寒手足冰冷、麻痹、咽喉干、慢性咳嗽。\n正常：此经络脉相平和，在运行气血，感应传导方面表现良好，请继续保持。\n偏高：呼吸不畅、咽喉异常、胸闷、气喘、扁桃炎、咳嗽、肩背酸痛易患痔疮，也可以由于高原反应、练气功，女性生理周期，怀孕等原因增高。",
      },
    },
    {
      name: "胃经",
      date: -39,
      describe: {
        describe:
          "中医里说脾胃是人的“后天之本”，就是说它们是人生下来活下去的根本保证，为什么这么说呢？因为脾胃具备了我们现在所说的整个消化吸收功能，是人体的能量源头。脾胃管着能量的吸收和分配，脾胃不好，人体“电能”就不够用，“电压” 偏低，使很多器官运作代谢减慢，工作效率降低，或干脆临时停工。如果五脏六腑都不能好好工作，短期还可以用“蓄电池”的能源，长期下去就不够用了，疾病也就出来了。由此看来，养好后天的脾胃发电厂有多么重要!",
        walk: "本经自鼻翼两旁起始，上至鼻根中，在内眼角处与足太阳膀胱经相交，沿鼻外侧（承泣、四白、巨髎）下行，入上齿中，回出来挟着口的两旁，环绕嘴唇，向下交会于任脉的承浆穴；然后退回来沿着下颌的后下方，浅出于本经的大迎穴，沿着下颌角（颊车），上至耳前，经过足少阳胆经的上关穴，沿鬓发边际，上抵头角（头维），行至额前（神庭）。它下行的支脉，从大迎穴前边直下人迎，沿喉咙，进入锁骨上窝（缺盆）。深入体腔，贯穿膈肌，入属胃腑，联络脾脏。它外行的主干。从锁骨上窝向下，经乳部内侧向下挟着脐的两旁，进入到腹股沟（气街）部。它在腹内的一条支脉，从胃下口的幽门部开始，经腹至气街与外行的主干会合。自此合而下行，经大腿前边的髀关、伏兔、下至膝膑中，再向下沿胫骨外侧，走向足背，进入中趾内侧（厉兑）。另有一条支脉，从膝下3寸（足三里）处分出，向下到中趾外侧。它的又一条支脉，从足背部（冲阳）分出，至足大趾的内侧端（隐白），脉气由此与足太阴脾经相接。",
        summary:
          "主要病候：A 脏腑病：胃痛、呕吐或消谷善饥、肠鸣、腹胀、水肿、口渴、咽喉肿痛、鼻衄。B 经脉病：胸部、膝髌等本经循行部位疼痛、热病、发狂。\n主治概要：本经腧穴主治胃肠病、头面、目、鼻、口、齿痛、神志病及经脉循行部位的其他病证。\n主要表现：该经发生病变，主要表现为洒洒恶寒，面色发黑，癫狂，腹胀，鼻塞，衄血，颈肿，喉痛，颈部肿痛，沿胸、乳、股、胫外侧及足背部本经脉过处皆痛，饮食不化或消谷善饥等症状。",
        reason:
          "1.嗳气、呃逆、恶心、呕吐：多由胃失和降，胃气上逆，发为嗳气、恶心、呕吐等。\n2.胃脘胀痛：多由情志抑郁，或宿食停滞，从而导致胃气郁滞，和降失职，气机阻塞不通，不通则痛，故发胃脘胀满而痛。\n3.消谷善饥：多由胃热炽盛，腐熟功能亢进，水谷消化加速所致。 胃脘嘈杂：多由胃热（火），或胃阴亏损，虚热内生，胃腑失和所致。\n4.纳呆食少：多由胃气虚弱，腐熟功能减退，和降失职所致。",
        performance:
          "偏低：消化不良、易胃胀气和食欲不振、颜面浮肿、易打嗝、饭后容易胃痛、腹泻或呕吐。\n正常：此经络脉相平和，在运行气血，感应传导方面表现良好，请继续保持。\n偏高：容易饿、胃弱、关节异常、食欲异常、口干、易便秘 、胃酸过多、感染溃疡、咽喉炎、长痘等。",
      },
    },
    {
      name: "胆经",
      date: 17,
      describe: {
        describe:
          "中医认为胆主决断，帮人决断谋虑，使心情舒畅。胆经是人体重要的经络。跟人的情志关系密切。现代人经常会谋虑的东西太多，心里的压力太大。但是胆可以把你所谋虑的事情及时去决断。如果你胆的功能强大，你所谋略的事情就能够及时被决断，你的心情也就会舒畅。如果你所谋虑的东西不能被及时地决断，你会产生抑郁。胆经就可以解决这些问题。",
        walk: "起于目外眦（瞳。子谬），向上到额角返回下行至耳后，沿颈部向后交会大椎穴再向前入缺盆部入胸过膈，联络肝脏，属胆，沿胁肋部，出于腹股沟，经外阴毛际，横行入髋关节（环跳）。  耳部支脉：从耳后入耳中，出走耳前，到目外眦处后向下经颊部会合前脉。于缺盆部。下行腋部、侧胸部，经季肋和前脉会于髋关节后，再向下沿大腿外侧，行于足阳明和足太阴经之间，经腓骨前直下到外踝前，进入足第四趾外侧端（足窍明）。足背部支脉：从足临泣处分出，沿第一、二跖骨之间，至大趾端（大敦）与足厥阴经相接。",
        summary:
          "主要病候：A 脏腑病：口苦、目黄、疟疾、头痛、颌痛、目毗痛。B 经脉病：缺盆肿痛、腋下肿、胸胁、股及下肢外侧痛、足外侧痛、足外侧发热。\n主治概要： 本经腧穴主治侧头、目、耳、咽喉病、神志病、热病以及经脉循行部位的其他病证。\n主要表现：本经发生病变，主要表现为口苦，叹气，心窝及胁下疼痛，面色灰暗，皮肤干燥，头痛，目外眦痛，颔痛，锁骨上窝及腋下肿痛，瘰疬，疟疾，胸、胁、髋关节及下肢外侧本经脉过处疼痛，足第四趾不用，足外侧灼热，出汗，怕冷等。",
        reason:
          "1.长期高脂饮食，如动物脑、肝、肾及蛋黄等，可导致血液和胆汁中的胆固醇升高，极易产生胆石。此外，长期高脂饮食易使人肥胖，加之不好运动，导致胆囊肌肉张力下降，胆囊排空延缓，胆汁淤积，容易形成结石。\n2.喜爱甜食或过量摄取含糖量高的食物。精制的大米、面粉等会加速胆固醇的累积，造成胆汁内胆固醇、胆汁酸、卵磷脂之间比列失调。\n3.长期饮酒。长期饮酒可导致肝纤维化、肝硬化、脂肪肝等病变，使得胆汁排空受阻淤积，这也是诱因之一。\n4.饮食习惯不合理，如经常不吃早餐。\n5.饮水少会导致血黏、胆汁稠，长此以往会增加患胆结石的风险。\n6.由于遗传原因，这种情况多见于一个家族中多人患有胆病的家庭成员。",
        performance:
          "偏低：大脑供血不足，颈椎病、头昏、耳鸣或者因胆汁排毒代谢不良更容易生成结晶、结石等。\n正常：此经络脉相平和，在运行气血，感应传导方面表现良好，请继续保持。\n偏高：头痛，头胀，焦虑，口苦等。",
      },
    },
    {
      name: "膀胱经",
      date: -5,
      describe: {
        describe:
          "足太阳膀胱经是十四经络中最长的一条经脉，也是穴位最多的经脉，它的畅通与否直接掌控着我们身体内毒素的排泄，绝不能忽略它。如果膀胱经发生异常，会影响全身毒素的排泄，从而出现头痛、头重、流鼻血、全身肌肉酸痛、脸部皮肤失去光泽、耳鸣、听力不佳、容易疲劳，精神欠佳等症状。我们可从刺激膀胱经上的穴位，消除和缓和各种不舒服感。",
        walk: "本经自内眼角（睛明）起始，上向额部（神庭），在头顶与督脉相会（百会）。它的分支，从头顶到耳上角。它直行的主干，从头顶入颅，联系脑，回出来从后项部左右分开向下，一支沿着肩胛内侧，脊柱两旁，达到腰部，由此深入，沿脊柱两侧的肌肉，联络肾脏，属于膀胱。它在腰部的分支，从腰部挟脊继续下行，通过臀部，进入膝腘窝中（委中）。 它的另一条支脉，从后项向下，自肩胛内缘，直至肩胛下面，挟着脊柱向下，经过髋关节，沿着大腿后面下行，在腘窝中与前支经脉会合。由此合而下行，通过腓肠肌内，出外踝后方，沿第五跖骨粗隆（京骨）到足小趾外侧末端（至阴）。脉气由此与足少阴肾经相接。",
        summary:
          "主要病候：A 脏腑病：小便不通、遗尿、癫狂、疟疾、目痛迎风流泪、鼻塞多涕、鼻衄、头痛。B 经脉病：项、背、股、臀和下肢后侧本经循行部位疼痛。\n主治概要：本经腧穴主治头、项、目、背、腰、下肢部病证以及神志病，背部第一侧线的背俞穴及第二侧线相平的腧穴，主治与其相关的脏腑病证和有关的组织器官病证。\n主要表现：该经不同时主要表现为顶头痛，目痛，目黄，泪出，鼻衄，痔疾，癫狂，项、背、腰、骶、大腿后侧、腘窝、腓肠肌、脚部疼痛，足小趾不用等。",
        reason:
          "1.主要是寒湿，血瘀体质造成 ；肾气主上升，膀胱之气主通降。\n2.肾气之升，激发尿液的生成并控制其排泄；膀胱之气通降，推动膀胱收缩而排尿。\n3.若肾气和膀胱之气的激发和固摄作用失常，膀胱开合失权，既可出现小便不利或癃闭，又可出现尿频、尿急、遗尿、小便不禁等。",
        performance:
          "偏低：头昏，大脑供血不足，小便异常等，脸色暗沉，长斑，毒素内积。\n正常：此经络脉相平和，在运行气血，感应传导方面表现良好，请继续保持。       \n偏高： 膀胱经有火。通常感冒会偏高。脑袋强烈思考；喝茶、咖啡或提神饮料也会引起偏高。女性生理期也会偏高。",
      },
    },
  ],
};

const tongueDate = {
  score: 50,
  features: [
    {
      feature_category: "面部",
      feature_group: "面色",
      feature_name: "面色白",
      feature_situation: "异常",
      feature_interpret:
        "面色较正常偏白。主要因为各种原因导致的气血亏虚、失血、阳气虚弱等原因使血液不能充盈面部，出现面色偏白的情况。正常人在天气寒冷时也可出现面色偏白。",
    },
    {
      feature_category: "面部",
      feature_group: "面部光泽",
      feature_name: "面色明亮",
      feature_situation: "正常",
      feature_interpret:
        "脸色荣润有光泽。面色随着精气充养而有光泽，故面色明润光泽的表示身体健康状态良好，无明显疾病表现；若有疾病表现，多处于疾病早期，病情轻，容易恢复，不容易出现并发症等。",
    },
    {
      feature_category: "面部",
      feature_group: "眼神",
      feature_name: "有神",
      feature_situation: "正常",
      feature_interpret: "目光明亮，精神饱满。",
    },
    {
      feature_category: "面部",
      feature_group: "眉头紧皱",
      feature_name: "正常",
      feature_situation: "正常",
      feature_interpret: "眉间正常，无皱纹凹陷。",
    },
    {
      feature_category: "面部",
      feature_group: "眉毛浓淡",
      feature_name: "浓眉",
      feature_situation: "正常",
      feature_interpret: "眉毛浓厚。",
    },
    {
      feature_category: "面部",
      feature_group: "眼皮层数",
      feature_name: "单眼皮",
      feature_situation: "正常",
      feature_interpret: "眼皮无褶皱。",
    },
    {
      feature_category: "面部",
      feature_group: "唇型",
      feature_name: "唇厚",
      feature_situation: "正常",
      feature_interpret: "上下任意唇体饱满，成曲面，状似鱼肚。",
    },
    {
      feature_category: "面部",
      feature_group: "唇色",
      feature_name: "唇红",
      feature_situation: "异常",
      feature_interpret:
        "唇色较正常偏红。主要由于体内热重，血液循环加速，血液充盈唇部。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌色",
      feature_name: "舌色暗",
      feature_situation: "异常",
      feature_interpret:
        "舌色暗、颜色不够鲜活，多因为舌体肌肉血液循环不畅。多见于全身或者身体局部血液循环不畅。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌尖色",
      feature_name: "正常",
      feature_situation: "正常",
      feature_interpret: "舌尖颜色正常",
    },
    {
      feature_category: "舌部",
      feature_group: "舌质",
      feature_name: "舌质老",
      feature_situation: "异常",
      feature_interpret:
        "舌质纹理粗糙或皱缩，形色坚敛苍老，舌色较暗的表现。多提示体内有实证。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌齿痕",
      feature_name: "舌部齿痕",
      feature_situation: "异常",
      feature_interpret:
        "舌边被牙齿挤压产生的痕迹。正常人也有出现；多见于脾虚、气虚、湿气较重的群体。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌裂纹",
      feature_name: "正常",
      feature_situation: "正常",
      feature_interpret: "无明显裂纹。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌形胖瘦",
      feature_name: "舌部肥胖",
      feature_situation: "异常",
      feature_interpret:
        "舌体比正常舌大，伸舌满口，多因为舌体肌肉水肿所致。多见于体内水分代谢不良，湿邪痰浊较重。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌点刺",
      feature_name: "舌点刺",
      feature_situation: "异常",
      feature_interpret:
        "舌面上出现红色或白色的芒刺状小点。多见于内热或阴虚火旺的群体。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌瘀斑瘀点",
      feature_name: "正常",
      feature_situation: "正常",
      feature_interpret: "无明显瘀斑瘀点。",
    },
    {
      feature_category: "舌部",
      feature_group: "苔色",
      feature_name: "舌苔黄",
      feature_situation: "异常",
      feature_interpret: "舌头上附着的苔状物呈白色。多提示体内有热象。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌苔腻",
      feature_name: "舌部苔腻",
      feature_situation: "异常",
      feature_interpret:
        "舌面上像是置有一层油腻状黏液，多因为舌面角化层脱落周期延长，食物残渣、细菌等附着物增多。多提示体内有湿气、痰湿、食积等。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌苔腐",
      feature_name: "正常",
      feature_situation: "正常",
      feature_interpret: "舌苔不腐。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌苔厚薄",
      feature_name: "舌苔厚",
      feature_situation: "异常",
      feature_interpret:
        "透过舌苔不能见到舌体肌肉，多因为舌面角化层附着的食物碎屑、唾液、细菌、白细胞较多。多提示身体代谢不佳，体内有湿邪、食积等。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌苔润燥",
      feature_name: "舌苔燥",
      feature_situation: "异常",
      feature_interpret:
        "舌苔干燥缺乏水分。提示体内水分不足，津液缺失或者水液运输障碍。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌苔剥脱",
      feature_name: "正常",
      feature_situation: "正常",
      feature_interpret: "无剥落。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌上焦-舌尖形态",
      feature_name: "正常",
      feature_situation: "正常",
      feature_interpret: "舌尖形态正常。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌中焦-脾胃区域",
      feature_name: "中焦凹陷",
      feature_situation: "异常",
      feature_interpret: "舌中部凹陷。多与脾胃虚弱相关。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌中焦-肝胆区域",
      feature_name: "两侧凸起",
      feature_situation: "异常",
      feature_interpret:
        "舌中段两侧较正常凸起。多与情绪压力大、肝气郁滞，肝胆瘀滞。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌下焦-凹凸形态",
      feature_name: "舌下焦凹陷",
      feature_situation: "异常",
      feature_interpret: "舌根部较正常凹陷。多与肾气不足、肾阳不足相关。",
    },
    {
      feature_category: "舌部",
      feature_group: "舌下脉络",
      feature_name: "舌下静脉怒张",
      feature_situation: "异常",
      feature_interpret:
        "舌头下面舌系带两边那两条青紫色的脉络粗长怒张。多见于全身或者身体局部血液循环不畅。",
    },
  ],
  physique_name: "湿热体质、血瘀体质",
  physique_analysis:
    "您的体质主要是湿热体质兼血瘀体质，体质的形成可能受到多种因素的影响：湿热体质多是因过多进食肉类、细粮、高蛋白、高糖、高油脂等食物，或久坐不动、喜抽烟饮酒、长期生活在潮湿的环境、自身脾气急躁等原因导致身体生湿化热，进而影响整体健康。同时，血瘀体质多因外伤、手术等引起血液流出血管，淤积体内；或者因为感受寒邪、热邪、湿邪等引起身体血液循环障碍；或者因为精神压力大，情绪压抑导致血液循环障碍。",
  typical_symptom:
    "面部油腻；易长痤疮；情绪烦躁；口中粘腻；口干；口苦；口渴不予饮水；大便粘腻；大便不爽；阴囊潮湿；湿疹；出汗黄；出汗粘；面色晦暗；皮肤偏暗；色素沉着；容易长斑；易患疼痛；口唇暗淡；口唇紫；眼眶暗黑；鼻部暗滞；易脱发；肌肤干燥；皮肤粗糙；",
  risk_warning:
    "湿热体质和血瘀体质在中医理论中代表了两种不同的身体状态，它们各自关联着一些特定的健康风险和躯体症状。\n皮肤问题：湿热体质易导致皮肤油腻、易生痤疮、湿疹等，而血瘀体质可能引起皮肤晦暗、色素沉着、瘀斑，两者结合可能使皮肤问题更为复杂，如痘痘难以愈合，留疤留印。\n循环系统问题：血瘀体质可能导致血液循环不畅，出现疼痛（如胸闷、头痛）、肢体麻木、手脚冰凉等症状。湿热则可能加重这些症状，引起局部肿痛、炎症反应增强。\n消化系统不适：湿热体质常伴有消化不良、大便黏滞不畅，血瘀体质可能导致腹部胀痛、固定不移。二者结合可能使消化系统症状加重，如胃痛、便秘或腹泻交替。\n情绪与精神状态：湿热体质易感烦躁、易怒，血瘀体质可能导致情绪抑郁、精神不振。两种体质的共同作用可能使人情绪波动大，精神状态不稳定。\n女性健康问题：女性可能面临月经不调、痛经、经色暗红有血块等问题，血瘀使经血排出不畅，湿热则可能加重痛经、增加妇科炎症的风险。\n体重管理困难：湿热体质可能导致体重增加，血瘀体质可能影响新陈代谢，两者结合可能使体重控制变得更加困难。\n易感其他疾病：长期的湿热与血瘀体质可能增加患心血管疾病、糖尿病、脂肪肝等慢性疾病的风险。",
  syndrome_uuid: "4914f5d8-775f-11eb-94a2-98039b0809cc",
  syndrome_name: "肝胆湿热瘀滞证",
  syndrome_introduction:
    "因湿热内蕴，肝胆气滞血瘀所致。临床以胁肋胀痛或刺痛，胁下痞块触痛、拒按，纳呆，呕恶，厌油腻，小便黄，舌质红，或有瘀点、瘀斑，舌苔黄腻，脉弦涩而数，或伴见身目发黄，发热，口苦等为特征的证候。",
  advices: [
    {
      food: [
        {
          title: "禁忌饮食",
          advice: "忌辛辣刺激之品。",
        },
        {
          title: "建议饮食",
          advice: "宜食理气止郁、健脾化痰之品，如扁豆、佛手、萝卜等。",
        },
        {
          title: "食疗建议",
          advice:
            "党参淮山猪肉汤：\n取党参15克，淮山15克，猪肉200克。将党参、淮山洗净，猪肉切块；将所有材料放入锅中，加水适量，大火煮沸后转小火炖煮1-2小时，加盐调味即可。",
        },
      ],
      music: [
        {
          title: "音乐建议",
          advice:
            "五音疗法：可用羽调式音乐补肾以益肝，肝木克伐脾土亦可治疗脾之实证。如贝貝多芬：第九交响曲第四乐章《快乐颂》多芬：第九交响曲第四乐章《欢乐颂》等音乐。",
        },
      ],
      sleep: [
        {
          title: "生活建议",
          advice: "湿衣服及汗衣皆不可久穿，以免暑热并袭，身生疮毒。",
        },
        {
          title: "情志建议",
          advice:
            "保持心情愉快，精神乐观，情绪稳定，避免情志为害，减少发病，避免惊恐及忧思恼怒等不良刺激。",
        },
        {
          title: "疾病建议",
          advice:
            "已有溃疡者可外敷拔毒膏，或新鲜蒲公英、马齿苋、野菊花各等量洗净捣烂外敷。",
        },
        {
          title: "居住环境建议",
          advice: "居室宜凉爽、通风、安静。",
        },
      ],
      sport: [
        {
          title: "运动建议",
          advice: "适当选择有氧运动，比如太极拳、五禽戏、慢跑等。",
        },
      ],
      treatment: [
        {
          title: "刮痧疗法",
          advice:
            "取尺泽、鱼际、曲池、内庭、大椎、外关等穴位，在局部涂抹适量刮痧油，用力要轻柔，不可用力过重，可用刮板棱角刮拭，以出痧为度，等刮痧部位印迹消退后可进行第二次刮痧。一般间隔3~7天。10-15次为1个疗程。",
        },
        {
          title: "按摩疗法",
          advice:
            "按摩关元、天枢、气海穴，每穴3-5分钟，每天2-3次。以局部有酸胀感，皮肤微红为度。",
        },
        {
          title: "艾灸法",
          advice:
            "将点燃的艾条，对准关元、命门、肾俞穴，以局部有温热舒适感为度。每穴每次艾灸15~20分钟，以灸后穴位局部皮肤潮红为度。每日1次，7~10次为1个疗程。可灸2~3个疗程。注意预防烫伤。",
        },
        {
          title: "拔罐疗法",
          advice:
            "取大椎、肺俞、心俞、委中穴，留罐，每次10～15分钟，起罐。待罐印褪去后，即可再次拔罐。",
        },
        {
          title: "穴位敷贴法",
          advice: "将五倍子3g，研末，用醋调成糊状，置于穴位贴上，贴在肚脐。",
        },
        {
          title: "耳穴疗法",
          advice:
            "取心、脾、内分泌、肾上腺、肾等耳穴。将耳穴消毒，在耳穴上贴王不留行籽或耳穴压丸，用拇、食指进行垂直按压，施压至患出现沉、重、胀、痛感。每穴按压1分钟左右。每穴重复操作2~3遍，每天3~5次。双侧耳穴轮流使用，2日1次替换。",
        },
        {
          title: "功法导引",
          advice:
            "可用六字诀进行呼吸训练以达到保健效果。六字诀是一种吐纳法。它是通过呬、呵、呼、嘘、吹、嘻六个字的不同发音口型，唇齿喉舌的用力不同，以牵动不同的脏腑经络气血的运行。\n方法：首先预备姿势，两足开立，与肩同宽，头正颈直，含胸拔背，松腰松胯，双膝微屈，全身放松，呼吸自然。\n其次联系呼吸，顺腹式呼吸，先呼后吸，呼所时读字，同时提肛缩肾，体重移至足跟。\n最后调息， 每个字读六遍后，调息一次，以稍事休息，恢复自然。",
        },
        {
          title: "药熨法",
          advice:
            "吴茱萸100g、粗盐300g，共炒至微呈黄色时，倒入布袋内，热敷腹部，盖被保温，15~30分钟左右。亦可先放入布袋内封包，微波炉加热2-3分钟使用。注意预防烫伤。",
        },
        {
          title: "中药泡足法",
          advice:
            "可用花椒、黄芪各30克，延胡索、红花、制附子片各15克，加清水1500毫升，煎沸15~20分钟，将煎好的药汤乘热倒入盆内，待温度适宜泡足，水位高于小腿1/3疗效更佳。每次可持续15~20分钟。每日1~2次，5天为一疗程。注意预防烫伤、头晕、过度出汗等。",
        },
        {
          title: "放血疗法",
          advice: "取血海、膈俞穴放血，放血数滴，至出血量变少即可。",
        },
        {
          title: "叩齿保健法",
          advice:
            "可行叩齿保健法以达到健脾益胃，纳气补肾的效果，古人认为齿健则身健，身健则长寿。方法：口唇轻闭，首先，上下门牙齿叩击9次，然后左侧上下牙齿叩击9次，右侧上下齿叩击9次，最后上下门齿再叩击9次。每日早晚各一次，每次3分钟左右。叩齿时可用双手指有节律地搓双侧耳孔，提拉双耳廓直到发热为止。",
        },
      ],
    },
  ],
  goods: [],
  tf_detect_matches: [
    {
      url: "https://mddfiles.oss-cn-shanghai.aliyuncs.com/mdd-back-all/.upload/2024/12/14/6b05feb4-23ae-4e46-b077-47624e8ee057.jpeg",
      detect_boxes: [
        {
          left_x: 252,
          left_y: 75,
          right_x: 871,
          right_y: 810,
          name: "舌苔厚",
        },
        {
          left_x: 66,
          left_y: 345,
          right_x: 97,
          right_y: 424,
          name: "舌部齿痕",
        },
      ],
    },
  ],
  detectionImage: {
    ffImage: '',
    tfImage: '',
    tbImage: '',
  }
};

export { pulseDate, tongueDate };
